app/views/posts/show.html.erb

<h3>Comments</h3>
<% @post.comments.each do |comment| %>
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 7