app/controllers/comments_controller.rb

	def create
		@post =Post.find([params[:post_id]])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 7 LIMIT 1