app/controllers/posts_controller.rb

	def create
		#render plain: params[:post].inspect
		@post = Post.new(post_params)

		if(@post.save)
---
INSERT INTO `posts` (`title`, `body`, `created_at`, `updated_at`) VALUES ('vnmcvn vmcnvmnv vmcnvmn ', 'dnsnsmdn dsmdnmsnd dmdnsmnd mdsmnd', '2020-09-08 19:41:58.820484', '2020-09-08 19:41:58.820484')

	def update
		@post =Post.find(params[:id])

		if(@post.update(post_params))
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
UPDATE `posts` SET `posts`.`title` = 'How To Be Rich in 2 days', `posts`.`updated_at` = '2020-09-08 19:41:34.861933' WHERE `posts`.`id` = 2

	def destroy
		@post =Post.find(params[:id])

		if(@post.destroy)
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 5 LIMIT 1
DELETE FROM `posts` WHERE `posts`.`id` = 5